Tekla.Structures.Model.ContourPlate
The ContourPlate class represents a part made with a contour, such as, a concrete slab.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ContourPoint point =  new ContourPoint(new Point(   0, 4000, 0), null);
ContourPoint point2 = new ContourPoint(new Point(2000, 4000, 0), null);
ContourPoint point3 = new ContourPoint(new Point(   0, 6000, 0), null);
ContourPlate CP = new ContourPlate();
CP.AddContourPoint(point);
CP.AddContourPoint(point2);
CP.AddContourPoint(point3);
CP.Finish = "FOO";
CP.Profile.ProfileString = "PL200";
CP.Material.MaterialString = "Steel_Undefined";
bool Result = false;
Result = CP.Insert();
}
}

Tekla.Structures.Model.ContourPlate._type
The type of the PolyBeam.

Tekla.Structures.Model.ContourPlate.Type
Gets the read only type of the contour plate.
In creation, the type is defined based on the material.
If the material is concrete, the type will be slab, otherwise plate.

Tekla.Structures.Model.ContourPlate.Contour
Gets or sets the contour for the contour plate.

Tekla.Structures.Model.ContourPlate.LevelName
Gets or sets the level name.

Tekla.Structures.Model.ContourPlate.LevelOffset
Gets or sets the level offset.

Tekla.Structures.Model.ContourPlate.#ctor
Initializes a new instance of the Tekla.Structures.Model.ContourPlate class.

Tekla.Structures.Model.ContourPlate.AddContourPoint(Tekla.Structures.Model.ContourPoint)
Adds a contour point to the contour plate.
contourPoint: The contour point that is to be inserted.
Returns: True on success, false if there is no more space for another contour point.

Tekla.Structures.Model.ContourPlate.Insert
Inserts the contour plate into the model database. All the attributes must be set.
Remarks:
Internal code of TeklaStructures can rearrange points of Contour to get a valid coordinate system.
Calling method Select after inserting plate is recommended to get the Contour as stored in model database.
Returns: True on success.

Tekla.Structures.Model.ContourPlate.Select
Selects a contour plate from the model database. The identifier of the contour plate must be set.
Returns: True on success.

Tekla.Structures.Model.ContourPlate.Modify
Modifies the existing contour plate in the model database to match the current one. The identifier must
be set.
Returns: True on success.

Tekla.Structures.Model.ContourPlate.Delete
Deletes the contour plate instance with the given identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.ContourPlate.GetContourPolycurve
Get contour as polycurve
Returns: Polycurve instance or null